# Base utils
brew "ack"
brew "bash-completion"
brew "coreutils"
brew "dos2unix"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "htop-osx"
brew "jq"
brew "mobile-shell"
brew "moreutils"
brew "mtr"
brew "nmap"
brew "pstree"
brew "pwgen"
brew "ssh-copy-id"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"

# Dev tools
brew "git"
brew "hub"
brew "tig"
brew "mercurial"
brew "subversion"

# Python
brew "pyenv"
brew "python"

# JavaScript
brew "node"

# Brew Cask
brew "brew-cask"
tap "caskroom/cask"
tap "caskroom/versions"

# OS X Apps
cask "alfred"
cask "firefox"
cask "flux"
cask "gfxcardstatus"
cask "google-chrome"
cask "iterm2"
cask "packer"
cask "spectacle"
cask "sublime-text3"
cask "things"
cask "vagrant"
cask "virtualbox"
cask "vmware-fusion"
