# Base utils
brew "ack"
brew "bash-completion"
brew "colordiff"
brew "coreutils"
brew "dos2unix"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "graphviz"
brew "htop-osx"
brew "jq"
brew "mobile-shell"
brew "moreutils"
brew "mtr"
brew "nmap"
brew "pstree"
brew "pwgen"
brew "ssh-copy-id"
brew "stow"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"

# Bash completions
tap "homebrew/completions"
brew "homebrew/completions/fabric-completion"
brew "homebrew/completions/vagrant-completion"
brew "homebrew/completions/docker-completion"
brew "homebrew/completions/docker-compose-completion"

# Dev tools
brew "git"
brew "hub"
brew "tig"
brew "mercurial"
brew "subversion"
brew "phantomjs"
brew "chromedriver"
brew "swig"
brew "terraform"
brew "httpie"

# Databases
brew "postgresql"
brew "sqlite"

# Libs
brew "openssl"
brew "zeromq"

# Python
brew "pyenv"
brew "python"

# JavaScript
brew "node"

# Brew Cask
brew "brew-cask"
tap "caskroom/cask"
tap "caskroom/versions"

# OS X Apps
cask "alfred"
cask "cyberduck"
cask "firefox"
cask "flux"
cask "freemind"
cask "gfxcardstatus"
cask "google-chrome"
cask "iterm2"
cask "mendeley-desktop"
cask "packer"
cask "qlstephen"
cask "rescuetime"
cask "spectacle"
cask "sublime-text3"
cask "things"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "vmware-fusion"
