# Base utils
brew "ack"
brew "bash-completion"
brew "colordiff"
brew "coreutils"
brew "dos2unix"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jq"
brew "mobile-shell"
brew "moreutils"
brew "mosh"
brew "mtr"
brew "nmap"
brew "pstree"
brew "pwgen"
brew "ssh-copy-id"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "unrar"
brew "watchman"
brew "wget"
brew "wireguard-tools"
brew "wrk"

# Bash completions
brew "fabric-completion"
brew "vagrant-completion"
brew "docker-completion"
brew "docker-compose-completion"

# Dev tools
brew "chromedriver"
brew "geckodriver"
brew "httpie"
brew "shellcheck"

# Databases
brew "postgresql"
brew "sqlite"

# Libs
brew "openssl"
brew "zeromq"

# Go
brew "go"
brew "dep"

# Haskell
brew "ghc"

# Brew Cask
tap "caskroom/cask"
tap "caskroom/versions"

# OS X Apps
cask "alfred"
cask "brave-browser"
cask "chromium"
cask "cyberduck"
cask "docker"
cask "firefox"
cask "flux"
cask "freemind"
cask "gfxcardstatus"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "mendeley"
cask "qlstephen"
cask "rescuetime"
cask "transmission"
# cask "vagrant"
cask "virtualbox"
cask "vmware-fusion"
