# Base utils
ack-grep
bash-completion
colordiff
coreutils
curl
dos2unix
gawk
gnupg
graphviz
gthumb
htop
jq
mosh
moreutils
mtr
nmap
numlockx
optipng
pnginfo
psmisc
pwgen
stow
tmux
traceroute
tree
vim
wget
whois
xclip
zsh

# Emoji support
fonts-noto-color-emoji
fonts-emojione
gnome-characters

# Bash completion
bash-completion
python3-argcomplete

# Apps
chromium-browser
chromium-chromedriver
firefox
firefox-geckodriver
handbrake
transmission-gtk

# Development
build-essential
git
golang-1.10
httpie
mercurial
phantomjs
python3-dev
python3-jedi
python3-rope
subversion
vagrant
virtualbox
